{"id":14155,"date":"2015-01-03T15:19:51","date_gmt":"2015-01-03T15:19:51","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=14155"},"modified":"2018-04-24T17:50:31","modified_gmt":"2018-04-24T21:50:31","slug":"linkedin-headshots-portrait-toronto","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/linkedin-headshots-portrait-toronto\/","title":{"rendered":"New LinkedIn Headshots?"},"content":{"rendered":"<p>Your headshot is one of the most important elements of your LinkedIn profile. A good first impression encourages the viewer to read the rest of your profile. In fact, your profile is 14x more likely to be viewed simply by having a profile picture. As a professional photographer specializing in professional headshots and executive portraits, I’ve learned a few lessons along the way about how to create a strong <strong><a href=\"http:\/\/www.linkedin.com\/pulse\/20140918182042-12287692-why-your-headshot-is-more-important-than-you-might-think\" target=\"_blank\" rel=\"noopener\">LinkedIn profile picture<\/a><\/strong>.<\/p>\n<p>1. Get A Professional Headshot, First of all, have an actual photo. No one will take you seriously if you have the default silhouette. Hire a professional to take your shot. They will get the lighting right, coach you to a good expression and maybe even have a makeup artist in tow. If you want to be perceived as a professional, you have to act like one. People can tell if you snapped a selfie or cropped yourself out of a group shot. Whose hand is that on your shoulder and why is it in your photo?<\/p>\n<p>2. Have a Photo That Looks Like You Every time I get ready for a meeting, I check out the person I’m meeting on LinkedIn first, especially if we are meeting for the first time at lunch or a coffee house. If the photo is not what they look like now, I wonder about their credibility and self-confidence. Is your profile photo more than two years old? Has your hairstyle changed drastically? Do you wear glasses, but not have them on in your profile photo? If so, it is time for a new headshot.<\/p>\n<p>3. Fill The Frame With Face No one cares about the third button down on your shirt. They aren’t likely to need to know what the top of your head looks like. If they are thumbing their smartphone looking through photos of the 116 men named Scott Kline on LinkedIn, they aren’t going to recognize you from the shot of you on your mountain bike. Crop the photo from just below the shoulders to no higher than just above your head. I even crop into the top of the head in most cases.<\/p>\n<p>4. Dress Appropriately for Your Industry Hawaiian shirts are great for the politician from Maui. Suits and ties are great for many in the financial industry. What do people in your industry wear? If you are worried, err on the side of dressing up a little. It never hurts to have clean, new garments. Remember to look like yourself, but maybe yourself on your best day. Here are more wardrobe tips.<\/p>\n<p>5. Make Sure Background is Not Distracting Get the background as neutral as possible. I prefer white background for the photo. Other colours can work too. Make sure there is a contrast to separate you from the background. Avoid busy backgrounds like words, complex geometric shapes or lines running through your head. Solid white or grey are hardly ever a problem when your face is well lit. Now that you know how to do it, let us help you update that LinkedIn profile photo for $100 (this offer never expires ). <a title=\"Book a Professional Photoshoot in Toronto today\" href=\"https:\/\/anerdsworld.com\/best-toronto-web-design\/\"><strong>Contact us for a headshot shoot today<\/strong>.<\/a><\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your headshot is one of the most important elements of your LinkedIn profile. A good first impression encourages the viewer to read the rest of your profile. In fact, your profile is 14x more likely to be viewed simply by&#8230;<\/p>\n","protected":false},"author":1,"featured_media":15299,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[53,51,64],"tags":[],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/14155"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=14155"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/14155\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/15299"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=14155"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=14155"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=14155"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}