{"id":16396,"date":"2015-08-17T20:00:28","date_gmt":"2015-08-17T20:00:28","guid":{"rendered":"http:\/\/www.anerdsworld.com\/?p=16396"},"modified":"2018-03-14T23:39:09","modified_gmt":"2018-03-15T03:39:09","slug":"what-is-local-seo","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/what-is-local-seo\/","title":{"rendered":"What is Local SEO ?"},"content":{"rendered":"<p>https:\/\/www.youtube.com\/watch?v=PldG81ZE0z0<\/p>\n<p><strong>Local SEO<\/strong> is the essential components to every business and brand that wants long term online success across all search engines.<\/p>\n<h2>What is local SEO?<\/h2>\n<p><em><a href=\"https:\/\/anerdsworld.com\/seo-toronto\" target=\"_blank\" rel=\"noopener\">Local Search Engine Optimization<\/a><\/em> has grown significantly over the last few years, particularly given the rise of smartphone usage and better connectivity while outside of your home or office. Although it has a lot of similarities with organic SEO, it’s ultimately very different. Local SEO is focused on providing results that are relevant to a searcher based on their current location. If I search for ‘<strong><a href=\"https:\/\/anerdsworld.com\/toronto-web-design-companyweb-development\/\">web desig<\/a><a href=\"https:\/\/anerdsworld.com\/toronto-web-design-companyweb-development\/\">n Toronto<\/a><\/strong>’ on my desktop right now, Google would provide me with the best website designers that are nearest to me. In 2011, it was revealed that over 40% of mobile queries have local intent. According to our sources, four out of five people use smartphones to look up local information. Two in three people take direct action as a result and one in three people went on to make a purchase. Google has also recently indicated that one in three Canadian mobile queries is now ‘local’ and 87% of people use their phone when on the go. Google also found that 95% of mobile users look up local information on their phones and the primary functions are actually visiting a business in person.<\/p>\n<h2>What can you do to optimize for local search?<\/h2>\n<p><strong>Google Places for Business:<\/strong> This is the very first thing you should do.  Claim your Google Places for Business page and make sure your contact information, opening hours, address and contact details are complete correctly. This will be the easiest way for your business to show up in search and maps.<\/p>\n<p><strong>Google+ Local:<\/strong> You will then need to link your Google Places page to a Google+ Local page. This page is more focused on social interaction. It can feature reviews, information about the restaurant, images and posts, plus users will be able to access images, videos and comments. Google Local results dominate so much that you have to scroll a long way down to find any others. If customers search directly through maps, the Local listings are even more dominant.<\/p>\n<p><strong>When creating a Google+ Local page ensure you do the following:<\/strong><\/p>\n<p>1. Optimize the information text about the business by using your keywords.  The page&#8217;s title should include your brand name, the keyword being targeted and the location. This should be possible to achieve without making either page or meta description come across as unnatural, as the objective remains to optimize for both users and search engines.<br \/>\n2. Reference your keywords in the title.<br \/>\n3. Make sure that you associate your listing with the right category.<br \/>\n4. Add your address in a consistent format with wherever else you’ve mentioned it.  NAP (name, address, phone number) citations are a key ranking factor in local SEO. NAP citations from relevant and authoritative websites provide more value, just like with links.  Clearly stating NAP information will work as a significant signal that you are a business related to a location, which will improve your visibility.<br \/>\n5. Encourage customers to leave reviews : Reviews are arguably the biggest local SEO ranking factor and are often compared to links in organic SEO.<br \/>\n6. Create a listing for each of your physical locations: This will ensure that people have the correct details for the nearest branch when searching locally and will give businesses more opportunities to increase rankings.<\/p>\n<p>Our headquarters are located in downtown Toronto, We are a boutique internet marketing agency comprised of expert copywriters, programmers, graphic designers and web designers. Being small is an asset in our industry, it allows us to move fast but keep personal. Adapting to the quickly changing nature (sometimes overnight) of the search engine optimization industry is integral to driving our clients’ success.<\/p>\n<p>Our team is on the leading edge of search engine optimization, and we only use white-hat techniques.<\/p>\n<p>Do you need assistance with your Search Engine Optimization campaign? Contact the <strong><span style=\"text-decoration: underline;\"><a href=\"https:\/\/anerdsworld.com\/seo-toronto\">best SEO company in Toronto<\/a><\/span><\/strong> today!<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>https:\/\/www.youtube.com\/watch?v=PldG81ZE0z0 Local SEO is the essential components to every business and brand that wants long term online success across all search engines. What is local SEO? Local Search Engine Optimization has grown significantly over the last few years, particularly given the&#8230;<\/p>\n","protected":false},"author":1,"featured_media":16399,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[52,56],"tags":[71,166,86,165],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/16396"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=16396"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/16396\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/16399"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=16396"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=16396"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=16396"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}