{"id":16713,"date":"2015-09-06T02:39:02","date_gmt":"2015-09-06T02:39:02","guid":{"rendered":"http:\/\/www.anerdsworld.com\/?p=16713"},"modified":"2015-09-08T03:06:57","modified_gmt":"2015-09-08T03:06:57","slug":"5-mistakes-in-logo-design","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/5-mistakes-in-logo-design\/","title":{"rendered":"5 Mistakes In Logo Design"},"content":{"rendered":"<p><img loading=\"lazy\" class=\" size-full wp-image-16778 alignnone\" src=\"http:\/\/www.anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design.jpg\" alt=\"5 mistakes in Logo Design\" width=\"600\" height=\"450\" srcset=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design.jpg 600w, https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design-400x300.jpg 400w, https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design-195x146.jpg 195w, https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design-50x38.jpg 50w, https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design-576x432.jpg 576w, https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/09\/5-mistakes-in-logo-design-100x75.jpg 100w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<p>With the power of the Internet, and more eyes watching than ever, it’s important for a business to communicate its unique message clearly. The easiest way to recognize a company and distinguish it from others is by its logo. Below, I go through 5 common logo design mistakes that you should avoid if you want to create a professional logo.<\/p>\n<h2><strong>1. Designed By An Amateur<\/strong><\/h2>\n<p>Avoid websites that promote ridiculously cheap logo packages such as <span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.fiverr.com\/\" target=\"_blank\">Fiverr<\/a><\/span>. You get what you pay for and $5 doesn&#8217;t buy much.  A business should look professional. New business owners often invest a lot of time and money in property and equipment, but do not often match it by investing suitably in their logo.<\/p>\n<p><span style=\"text-decoration: underline;\">Here are the most common reasons why many logos look amateurish:<\/span><\/p>\n<p>-The business owner wanted to save money by designing the logo themselves.<br \/>\n-Friend claims to know about graphic design does it as a favour.<br \/>\n-Wrong designers are commissioned.<br \/>\n-The job was given to an on-line company that offers really cheap logos.<\/p>\n<p>All of the above can result in less than memorable logo.  If your logo looks amateurish, then so will your business. A proper business should know where to look when it wants a new logo.<\/p>\n<p><span style=\"text-decoration: underline;\">Here are the advantages of hiring an established and professional logo designer:<\/span><\/p>\n<p>-Your logo will be unique and memorable.<br \/>\n-You won’t run into any problems down the line with reproducing it.<br \/>\n-Your logo will have a longer lifespan and won’t need to be redesigned in a couple of years.<br \/>\n-Your logo will look professional.<\/p>\n<h2><strong>2. Copying Logo<\/strong><\/h2>\n<p>This is the biggest logo design mistake of all and, unfortunately, is becoming more and more common. As mentioned, the purpose of a logo is to represent a business. If it looks the same as someone else’s, it has failed.<\/p>\n<h2><strong>3. Contains Stock Art<\/strong><\/h2>\n<p>Using stock vector graphics in a logo puts your client at risk.<\/p>\n<p>This mistake is often made by business owners who design their own logo or by amateur designers who are not clued in to the laws on copyright.<\/p>\n<p>Downloading stock vector imagery from websites such as <span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.vectorstock.com\/\" target=\"_blank\">VectorStock<\/a><\/span> is not a crime, but it could possibly get you in trouble if you incorporate it in a logo.<\/p>\n<p>A logo should be unique and original, and the licensing agreement should be exclusive to the client: using stock art breaks both of these rules. Chances are, if you are using a stock vector image, it is also being used by someone somewhere else in the world, so yours is no longer unique. You can pretty easily spot stock vectors in logos because they are usually familiar shapes, such as globes and silhouettes.<\/p>\n<h2><strong>4. Designing For Yourself<\/strong><\/h2>\n<p>Never impose your own personality onto a client’s work.  You can often spot this logo design sin a mile away; the cause is usually a designer’s enormous ego. If you have found a cool new font that you can’t wait to use in a design, well… don’t. Ask yourself if that font is truly appropriate for the business you’re designing for? For example, a great modern typographic font that you just love is not likely suited to a serious business such as a lawyer’s office.<\/p>\n<p>Some designers also make the mistake of including a “trademark” in their work. While you should be proud of your work, imposing your personality onto a logo is wrong. Stay focused on the client’s requirements by sticking to the brief.<\/p>\n<h2><strong>5. Poor Choice of Font<\/strong><\/h2>\n<p>When it comes to creating a professional logo, choosing the right font is the most important decision a designer can make. More often than not, a logo fails because of a poor font choice.<\/p>\n<p>Finding the perfect font for your <span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.anerdsworld.com\/toronto-graphic-designers-for-logo-corporate-identity-and-branding\/\">logo design in Toronto<\/a><\/span> is all about matching the font to the style of the icon. But this can be tricky. If the match is too close, the icon and font will compete with each other for attention; if the complete opposite, then the viewer won’t know where to focus. The key is finding the right balance, somewhere in the middle. Every typeface has a personality. If the font you have chosen does not reflect the icon’s characteristics, then the whole message of the brand will misfire.<\/p>\n<p>Bad fonts are often chosen simply because the decision isn’t taken seriously enough. Some designers simply throw in type as an afterthought. Professional font databases, such as <span style=\"text-decoration: underline;\"><a href=\"http:\/\/new.myfonts.com\/\" target=\"_blank\">MyFont<\/a><\/span> and <span style=\"text-decoration: underline;\"><a href=\"http:\/\/www.fontfont.com\/\" target=\"_blank\">FontFont<\/a><\/span>, offer much better typeface options than those over-used websites that offer free downloads.<\/p>\n<p>To conclude, Logo design is essential to the success of your growing business. The logo is part of your company’s marketing campaign, a strong image that your market can latch onto. It represents the nature, character, and values of your business and image really is everything in business. A company can either thrive or wither away based on the way it presents itself to the public. It&#8217;s for this very reason that your logo and corresponding brand can set you apart from your competitors. The way you present yourself and your business to the market at large should be positive, powerful, and leave a lasting impression. Our art direction and design team create custom business identities to breathe new life into our clients’ websites, banners and stores. A visually stunning logo and the branding it builds can make or break a business. Set up a free consultation with the <span style=\"text-decoration: underline;\"><a title=\"the best logo designers in Toronto\" href=\"https:\/\/anerdsworld.com\/best-toronto-web-design\/\">the best logo designers in Toronto today!<\/a><\/span><\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the power of the Internet, and more eyes watching than ever, it’s important for a business to communicate its unique message clearly. The easiest way to recognize a company and distinguish it from others is by its logo. Below,&#8230;<\/p>\n","protected":false},"author":1,"featured_media":16778,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[53,89,55],"tags":[200,202,201,203],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/16713"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=16713"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/16713\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/16778"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=16713"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=16713"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=16713"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}