{"id":17152,"date":"2015-11-05T08:46:11","date_gmt":"2015-11-05T13:46:11","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=17152"},"modified":"2015-11-10T23:43:58","modified_gmt":"2015-11-11T04:43:58","slug":"5-mistakes-to-avoid-when-building-a-new-website","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/5-mistakes-to-avoid-when-building-a-new-website\/","title":{"rendered":"5 Mistakes to Avoid when Building a New Website"},"content":{"rendered":"<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/EqFLF5LpJbs\" width=\"698\" height=\"383\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<div>We provide web design in Toronto that helps businesses increase revenue and enhance brand awareness with innovative <span style=\"text-decoration: underline;\"><a href=\"https:\/\/anerdsworld.com\/toronto-graphic-designers-for-logo-corporate-identity-and-branding\/\">logo design<\/a><\/span>, <span style=\"text-decoration: underline;\"><a href=\"https:\/\/anerdsworld.com\/toronto-graphic-design-firm-logo\/\">branding<\/a><\/span> and <span style=\"text-decoration: underline;\"><a href=\"https:\/\/anerdsworld.com\/toronto-web-design-companyweb-development\/\">website development in Toronto<\/a><\/span>.<\/div>\n<p><\/p>\n<div>When trying to gain new customers, subscribers, increase traffic or get repeat visitors in a competitive online world, your website will essentially be the face of your business. While more websites that have had years to build an established following may have some room to experiment, A Nerd’s World lists 5 mistakes to avoid in the website design.<\/div>\n<p><\/p>\n<div><strong>Mistake #1:<\/strong><\/div>\n<div>Unclear navigation. For newer businesses, having confusing navigation throughout your website can be your biggest downfall. Potential customers may become discouraged and not bother giving your business a fair shot if they can’t easily navigate their way around. I like using simple menu titles such as: “Home, About, Services, Blog, Contact” and not “Homepage, My Philosophy, My Specialities, Personal Journal Entry, Write to Me”. Also, make sure that your navigational bar menu runs horizontally across the top of the page because statistics proves that users respond best to this format.<\/div>\n<p><\/p>\n<div><strong>Mistake #2:<\/strong><\/div>\n<div>Incorrect placement of menu items or wrong order. Things that appear first or last on any list are most effective in drawing attention. Navigation is no exception. Psychology studies show that attention and retention are highest for things that appear at the beginning and the end. Known as  “serial position effect,” its basis is on the principles of primacy and recency. So put your most important items at the beginning of the navigation and the least important items in the middle. “Contact” should be the last item on the list, placing it at the far right in top-level horizontal navigation, a standard location.<\/div>\n<p><\/p>\n<div><strong>Mistake #3:<\/strong><\/div>\n<div>You’ve seen this before: that website with hundreds of links on the home page. Terrible. But even ten may be too many. Our short-term memory is only capable of holding seven items. That means that ten is a LOT more than seven. With fewer menu items, your visitors’ eyes are less likely to scan past important items. Every time you remove a menu item, the remaining items become more prominent. Challenge yourself to limit your navigation to five items.<\/div>\n<p><\/p>\n<div><strong>Mistake #4:<\/strong><\/div>\n<div>Disregarding mobile. While having a website that looks great and functions well on a computer is a complete necessity, disregarding how it will appear on mobile devices is doing your business a complete injustice.  Recent studies show that smartphones and tablets are the most common platforms that websites are browsed on today, so assuring that your site is compatible with this format is of the utmost importance. There is a high chance that the first time a user sees your website will be on a mobile device, so disregarding mobile compatibility will eliminate half of your potential market right off the bat.<\/div>\n<div><\/div>\n<div><strong>Mistake #5:<\/strong><\/div>\n<div>Straying away. While sometimes it pays off to take risks and dare to be different, you should avoid straying away from the norm when web designing for a new site.  Why fix what&#8217;s not broken?  Several effective tactics are not new, being tested and implemented years ago.  Proven to be effective, you can still see them in use today. For example, your company logo should always be present near the top left corner of the page and should send users back to the homepage upon clicking.<\/div>\n<p><\/p>\n<div>A Nerd’s World is an innovative, <strong>award-winning Toronto web design<\/strong> firm dedicated to providing clients with responsive websites that help grow brands and convert visitors to customers. With expertise in web development, branding, logo design, graphic design, photography, search engine optimization and e-commerce solutions.<\/div>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We provide web design in Toronto that helps businesses increase revenue and enhance brand awareness with innovative logo design, branding and website development in Toronto. When trying to gain new customers, subscribers, increase traffic or get repeat visitors in a&#8230;<\/p>\n","protected":false},"author":1,"featured_media":17276,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[89,55,50],"tags":[239,238,240,241,242],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/17152"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=17152"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/17152\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/17276"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=17152"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=17152"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=17152"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}