{"id":19213,"date":"2016-08-05T13:03:58","date_gmt":"2016-08-05T17:03:58","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=19213"},"modified":"2016-12-27T11:32:40","modified_gmt":"2016-12-27T16:32:40","slug":"writing-seo-friendly-content","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/writing-seo-friendly-content\/","title":{"rendered":"Writing SEO Friendly Content"},"content":{"rendered":"<p><a href=\"http:\/\/vimeo.com\/158123825\">http:\/\/vimeo.com\/158123825<\/a><\/p>\n<p>When it comes to search engine optimization, <a href=\"https:\/\/anerdsworld.com\/content-is-king-in-seo\/\"><strong>content is king<\/strong><\/a>. Producing original, targeted content on a regular basis is essential to the success of your website from an SEO standpoint. One question that clients often ask is how to produce website content that is SEO friendly. Here are my keys to <strong>writing SEO friendly content<\/strong>:<\/p>\n<h4>Write for People, Not Search Engines<\/h4>\n<p>Google and Microsoft (who own and operate Bing) are two of the most successful and innovative companies in the world. They can tell when you’re producing content that is targeted to rank highly on search engines. Instead of writing your content for the search engines, make sure that you’re writing it for people. What does that mean, exactly?<\/p>\n<p>First of all, readability is extremely important. You shouldn’t sacrifice readability and proper grammar in order to stuff keywords into your page or blog post. If you’re writing for search engines, they’ll eventually figure you out and you’ll likely see a drop in rankings as a result. If you write content that people want to read and share with others on social media, then your website will reap the benefits.<\/p>\n<h4>Include Keywords Early and Often (but not too often)<\/h4>\n<p>Although your writing style should be targeted towards humans rather than <a href=\"http:\/\/moz.com\/blog\/search-engine-algorithm-basics\" target=\"_blank\">search engine algorithms<\/a>, it’s essential that the search engines know what your content is about. That’s why you should include keywords in your headers and in the body of the text itself. Make sure that you use the exact keywords in the text once or twice before you start using synonyms. To use A Nerd’s World as an example, if your keyword topic is “<a href=\"https:\/\/anerdsworld.com\/web-design-services-toronto\/search-engine-optimization-toronto-seo\/\"><strong>Toronto SEO<\/strong><\/a>”, make sure you use that exact keyword before you use synonyms like “SEO in Toronto”.<\/p>\n<p>If you overuse keywords, the search engines will recognize and it will penalize you. It’s easy for users to recognize when content is keyword loaded, and it’s even easier for search engines.<\/p>\n<h4>Include Links and a Video or Image<\/h4>\n<p>Every page on your website, whether it’s a static page or blog post, should include links. If your page doesn’t have any outbound links, it’s viewed as a “<a href=\"http:\/\/www.searchenginejournal.com\/seo-terminology-orphan-and-dead-end-pages\/7373\/\" target=\"_blank\">dead end page<\/a>”. Dead end pages don’t add much value for search engines or users, so they rarely rank well from an SEO standpoint.<\/p>\n<p>My general rule is that every page or blog post should have at least four links&#8211;two internal links (links to another page or post within your site) and two external links (links to another relevant website).<\/p>\n<p>In addition to links, every page or post should have at least one video or image. No one wants to stare at a huge block of text. User experience matters. If you’re creating your own video to add to the page or post, make sure you say the exact keyword once or twice in the video. Search engines can pick up on it like they do with text. I recommend using YouTube since it’s owned by Google.<\/p>\n<h4>Proofread, Proofread, Proofread<\/h4>\n<p>This isn’t specific to writing SEO friendly content, but it’s so important to remember. Make sure your content is free of spelling errors, especially within your keywords. Search engines like websites that are an authority within their field, and it’s hard to become an authority when your content is riddled with bad grammar. Remember, readability is essential.<\/p>\n<p>Writing SEO friendly content is only the first step to SEO success. If you’d like to learn more about how you can optimize your website for search engines, we offer Toronto SEO tutorials starting at $120. Come work with the <a href=\"https:\/\/anerdsworld.com\/web-design-services-toronto\/search-engine-optimization-toronto-seo\/\"><strong>best SEO company in Toronto<\/strong><\/a>. Give us a call today at (647) 726-2020 to get started.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-18572\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2016\/06\/charlie-toronto-seo.png\" alt=\"toronto seo\" width=\"150\" height=\"50\" srcset=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2016\/06\/charlie-toronto-seo.png 150w, https:\/\/anerdsworld.com\/wp-content\/uploads\/2016\/06\/charlie-toronto-seo-50x17.png 50w\" sizes=\"(max-width: 150px) 100vw, 150px\" \/><\/p>\n<p>Charlie Ford<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to search engine optimization, content is king. Producing original, targeted content on a regular basis is essential to the success of your website from an SEO standpoint. One question that clients often ask is how to produce&#8230;<\/p>\n","protected":false},"author":1,"featured_media":18797,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[19,106,54,52,1,68,56],"tags":[17,80,133],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19213"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=19213"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19213\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/18797"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=19213"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=19213"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=19213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}