{"id":19299,"date":"2016-08-16T15:00:59","date_gmt":"2016-08-16T19:00:59","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=19299"},"modified":"2016-08-16T15:59:58","modified_gmt":"2016-08-16T19:59:58","slug":"5-extremely-successful-people-that-wear-a-t-shirt","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/5-successful-people-that-wear-a-t-shirt-everyday","title":{"rendered":"5 Extremely Successful People that Wear a T-Shirt"},"content":{"rendered":"<p><a href=\"https:\/\/www.youtube.com\/watch?v=1TwUEFtKflg&#038;feature=youtu.be\">https:\/\/www.youtube.com\/watch?v=1TwUEFtKflg&amp;feature=youtu.be<\/a><\/p>\n<p>Yes I wear a black t-shirt to work, 6 out of 7 days. Don’t worry, it’s not the same one, I have many black t-shirts. Some are v-necks, other crew cut. I like to believe that they help me look a bit slimmer, in addition to reducing the stresses of my everyday life. Each and every day, I’m faced with making many critical decisions. These decisions are much more important than what I had for breakfast or deciding on what combination of clothes will create my outfit for the day. This got me thinking and I started doing some research to see if there is some sort of phenomenon or something out there, with like-minded individuals. It turns out that my hunch was right, many successful people like entrepreneurs, celebrities and artists wear the same thing every day! The reasoning behind this ranges from making life simpler to just being smart with money. Where it gets more interesting is that there are also proven scientific reasons behind this.<\/p>\n<p>Science is showing us that this concept of simplifying the wardrobe is all related to the concept of decision fatigue. This is a psychological condition where a person’s productivity declines as a result of being mentally exhausted from making so many small, irrelevant decisions throughout everyday life. To make a long story short, it is easy to become less efficient at your work if you’re constantly stressing over things like what to eat or wear every day. Decision fatigue is exactly why individuals like Mark Zuckerberg, Mark Cuban, Steve Jobs, Casey Neistat and Gary Vaynerchuk decided to make life easier. I’d like to share a few details about each of these gentlemen with you, below:<\/p>\n<p><b>Mark Zuckerberg – <\/b>Net worth of $53.5 Billion USD<\/p>\n<p>Having the second-highest net worth of our 5 people here, this billionaire typically likes to wear a t-shirt or hoodie, along with a pair of jeans. In a Question and Answer session in November 2014, Mark Zuckerberg explains why he wears the same t-shirt everyday:<\/p>\n<p>“I really want to clear my life to make it so that I have to make as few decisions as possible about anything except how to best serve this community.<\/p>\n<p>“I’m in this really lucky position, where I get to wake up every day and help serve more than a billion people. And I feel like I’m not doing my job if I spend any of my energy on things that are silly or frivolous about my life.”<\/p>\n<p><b>Mark Cuban – <\/b>Net worth of $3.2 Billion USD<\/p>\n<p>Similarly to Zuckerberg, Mark Cuban is typically seen wearing the same suit over and over. Decision fatigue is real and Mark Cuban has been seen advocating to young millennials to live cheap and that clothes and cars don’t really matter.<\/p>\n<p><b>Steve Jobs – <\/b>Net worth of $29.2 Billion USD<\/p>\n<p>Steve Jobs is known for his signature black turtle neck and jeans. He was such a fan of this simple, repeatable look, that at one point he tried to have the whole company wear the same uniform. Jobs took a trip to Japan in the 1980s and was very moved to see everyone at Sony wearing a uniform. He took to the idea of adopting something similar at Apple. He thought that wearing the same corporate attire would help Apple employees come together&#8211;something school uniforms never seem to quite manage. He ultimately got booed for this.<\/p>\n<p><b>Casey Neistat – <\/b>Net worth of $1.5 Million USD<\/p>\n<p>While Casey Neistat will wear a suit when he has to, his daily threads consist of jeans or joggers, a t-shirt and\/or crewneck sweater, a pair of high-tops, some wrist-wear that is often a balance of a high-end watch\/apple watch and a few random beads and bracelets and – in the cooler months – a few layers of black jacketing. Casey Neistat both embraces and defies the negative – nerdy connotations that come with wearing a fanny pack or cell-phone belt clip, and keeps a digital camera holstered on his belt at all times. This may make you think that Neistat isn’t a fan of order and organization. You’d be wrong to assume that. Check out his <a href=\"https:\/\/www.youtube.com\/watch?v=vb60rrtTddQ\" target=\"_blank\"><span style=\"text-decoration: underline;\">studio video<\/span><\/a> to see what this man’s organizational capabilities are made of.<\/p>\n<p><b>Gary Vaynerchuk – <\/b>Estimated Net worth of $100 Million USD<\/p>\n<p>I’d like to share one of Gary’s famous quotes:<\/p>\n<p>“<i>You know I’m an Entrepreneur really, Like really really really what I am, I mean at 4 years old if you’re ripping flowers out of people’s yards and ringing their doorbell and desperately asking them to buy it or when your six and everyone wants to play dodge ball, or go on the swings and your desperately trying to get everybody to stand behind a lemonade stand for 8 hours during their summer vacation, I’m an Entrepreneur, I’m a salesman”<\/i><\/p>\n<p>He’s a very inspirational character that has experience in the world of Wine, Novel-writing and business investments. Like the other gentlemen of today’s article, Gary is routinely seen wearing the same casual outfit, further showing us proof that decision fatigue is a real thing.<\/p>\n<p>If you&#8217;re coming to A Nerd’s World for a meeting, don&#8217;t be surprised if you see us dressed in t-shirts and Nikes. Let us impress you with our expertise and skills, rather than superficial appearances.<\/p>\n<p>We’re here for hire. Give us a call today at <b>(647) 348 2020<\/b> to talk about your digital media needs!<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yes I wear a black t-shirt to work, 6 out of 7 days. Don’t worry, it’s not the same one, I have many black t-shirts. Some are v-necks, other crew cut. I like to believe that they help me look&#8230;<\/p>\n","protected":false},"author":1,"featured_media":19303,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[54,1,50],"tags":[],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19299"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=19299"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19299\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/19303"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=19299"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=19299"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=19299"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}