{"id":19326,"date":"2016-08-18T13:06:06","date_gmt":"2016-08-18T17:06:06","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=19326"},"modified":"2018-02-19T11:02:35","modified_gmt":"2018-02-19T16:02:35","slug":"my-first-business-at-12-years-old","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/my-first-business-at-12-years-old","title":{"rendered":"MY FIRST BUSINESS AT 12 YEARS OLD"},"content":{"rendered":"<p><a href=\"https:\/\/www.youtube.com\/watch?v=h19U_aEEh-k\">https:\/\/www.youtube.com\/watch?v=h19U_aEEh-k<\/a><\/p>\n<p>I&#8217;d like to start off by asking you two questions: How old were you when you first started a business and made some profit off of it? The second and equally important question is: Are you an entrepreneur?<\/p>\n<p>I was just 12 years old when I started my first business. The idea came to me during grade 6 when my grandparents introduced me to sports cards. Being a huge hockey fan, I instantly realized that these sports cards could take off with hockey fans and I could make some money.<\/p>\n<p><strong>STEP 1 &#8211; Brainstorming<\/strong><\/p>\n<p>My idea was to buy the cards in bulk rather than individually, since the cost was dramatically lower. So when it came to executing my plan, I had to beg my grandma to help me buy 2 boxes worth of cards. With the boxes in hand, I set out to package each one in its own clear plastic sleeve. My thinking was that this feature added extra perceived value to my customers. It later turned out that I was right!<\/p>\n<p>All of this had given me new motivation to go to school. Rather than focusing on the books like a lot of other 12 year old kids, my mission was to take special card requests from other students. I would also charge a little bit extra for rare cards such as Wayne Gretzky’s. Keep in mind that at this time, smart phones weren&#8217;t around, so I had a notepad that I&#8217;d carry around and make notes on.<\/p>\n<p><strong>STEP 2 &#8211; Be Open-Minded With Your Ideas<\/strong><\/p>\n<p>As I was becoming more successful with my sports card business at school, I opened booths at card trading shows that were held at the convention center in Toronto. I made sure to dress in a suit and tie. I wanted to be different and standout from my competitors, who were much older than me. I kept my table in immaculate condition. The way that I operated the booth involved 2 people, myself and one other person. One of us would go hand out flyers while the other would walk around the convention, closing sales. Just like my current A Nerd’s World retail location at 986 Bathurst Street, Toronto, I had colourful balloons at my convention booths.<\/p>\n<p>It&#8217;s kind of funny, a lot of what we&#8217;re doing today at A Nerd’s World, I did at 12 years old!<\/p>\n<p><strong>STEP 3 &#8211; Know Your Target Customer<\/strong><\/p>\n<p>Yorkgate mall is half the story of the third step. My idea was to go on the weekends and set up a booth somewhere in the mall. Instead of baseball cards, I would bring basketball ones since the demographics here were totally different. Teenagers around here weren&#8217;t into hockey at all. So this was a change involving different markets, different areas and different products.<\/p>\n<p>The other half of the third step involved me trying to sell my cards on the streets of my neighbourhood. My home didn&#8217;t have a garage so with the help of my good friend Jeremy, I used his garage as a booth to sell cards. I worked out a deal with his mom to pay her $50 a week. The operation was sweet! It had balloons, pull-tabs, flyers and I was promoting via word of mouth. It was booming, however one day the police showed up and shut down the operation. I quickly learned that in the city of Toronto, you can legally have a garage sale twice a year. I later found out that complaints from disgruntled neighbours were the trigger source for the police.<\/p>\n<p><strong>STEP 4 &#8211; Never Quit!<br \/>\n<\/strong><br \/>\nAt this point, I thought to myself “Now what?”<\/p>\n<p>I was at a loss for ideas until I came up with collecting autographs for each of my cards and selling them for more profit! I would call hotels to find out where athletes and celebrities were staying, through carefully crafted conversation with concierges. I was so successful with this and I&#8217;d do it so often that celebrities started catching on. They would get to know me by first name and would start asking me if I was selling these cards.<\/p>\n<p>I put their minds at ease by asking them to personalize the cards with my name, to prove that I wasn&#8217;t selling them. I, however, had other intentions. Little did the celebrities know that the sharpie I&#8217;d get them to use, was very easy to take off with cologne or an eraser. These tricks worked because the cards had a glossy coating.<\/p>\n<p>So with having these cards in hand, I considered this a wow-factor, one that made me different verus my competition. I had a low-cost, high-value.l product in the form of autographed sports cards.<\/p>\n<p>I like to be around like-minded people. If you&#8217;re in the toronto area and want to talk about any ideas, give me a shout and let&#8217;s talk!<\/p>\n<p>Stop thinking, stop coming up with a “master plan”, just do it, call me at A Nerd’s World at (647) 726-2020.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I&#8217;d like to start off by asking you two questions: How old were you when you first started a business and made some profit off of it? The second and equally important question is: Are you an entrepreneur? I was just&#8230;<\/p>\n","protected":false},"author":1,"featured_media":19328,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[19,54,56],"tags":[],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19326"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=19326"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19326\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/19328"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=19326"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=19326"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=19326"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}