{"id":19474,"date":"2016-10-17T15:54:46","date_gmt":"2016-10-17T19:54:46","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=19474"},"modified":"2018-02-19T11:01:10","modified_gmt":"2018-02-19T16:01:10","slug":"my-13-days-in-a-cuban-prison","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/my-13-days-in-a-cuban-prison\/","title":{"rendered":"13 DAYS IN A CUBAN PRISON"},"content":{"rendered":"<div class=\"fve-video-wrapper fve-image-embed fve-thumbnail-image youtube\" style=\"padding-bottom:75%;\">\n    <iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/T9xfVYrGpZo?wmode=transparent&#038;modestbranding=1&#038;autohide=1&#038;showinfo=0&#038;rel=0\" width=\"100%\" height=\"100%\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen><\/iframe>    <\/div>\n<p>Everyone complains about Mondays&#8211;If you Google &#8220;Monday Meme,&#8221; there is no shortage of funny images accompanied by witty one-liners about everyone&#8217;s least favourite day of the week.  <\/p>\n<p>If I told you today was like any other busy Monday, I&#8217;d be lying.  It&#8217;s my first day back in the office after a month of traveling, and it&#8217;s also my 38th birthday.  After a weekend of celebrating with my family, things still feel so surreal&#8211;to think that only a week ago, I was in a Cuban prison, unsure if I&#8217;d see my family, or have my feet on Canadian soil ever again.  After rehashing the events in my mind, I sometimes feel the urge to question if those thirteen days in jail actually happened.  <\/p>\n<p>If you&#8217;re reading this, you&#8217;re probably curious as to how I ended up in prison.  Before you read any further, I want to let you know that this post does not contain anything that would suggest that I have a personal vendetta against the Cuban government&#8211;I have a great love for the country, its people, and the culture, and have every intention of visiting the island again.  What I am about to share with you are the events that led up to my detainment and imprisonment.  Also, I want my story to serve as a warning for all drone and UAV enthusiasts who plan on traveling to Cuba, or any other country abroad.<\/p>\n<p>I was vacationing in Havana, a city which I have frequented in the past, never having encountered any problems with authorities, or otherwise.  While flying a recreational drone, in Confederation Square, I was detained by Cuban military officials.  At first, I didn&#8217;t know what was going on, however, when I realized my arrest was based upon suspicion of espionage and terrorist activity, I couldn&#8217;t believe it. <\/p>\n<div class=\"fve-video-wrapper fve-image-embed fve-thumbnail-image youtube\" style=\"padding-bottom:75%;\">\n    <iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/04ruPECpImE?wmode=transparent&#038;modestbranding=1&#038;autohide=1&#038;showinfo=0&#038;rel=0\" width=\"100%\" height=\"100%\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen><\/iframe>    <\/div>\n<p>I had flown into Havana from Panama just a few days earlier, and the drone had cleared customs with me.  I had never encountered any issues with it in the other countries I visited during my travels (Colombia and Panama) and didn&#8217;t see why it would be any different in Cuba.  Everything was going by so quickly&#8211;it was like trying to piece together something out of a foreign film (without subtitles).<\/p>\n<p>Cut to the next scene: They just confiscated my laptop and iPhone, and they&#8217;re now handing me a pillow case, a bedsheet, and half a bar of soap.  Every time I question what&#8217;s happening, the guards reassure me that everything is going to be OK.  <\/p>\n<p>Next scene: I&#8217;m startled by a door slamming behind me.  I&#8217;m standing in a 4&#8217;x7&#8242; cell with no windows, a small cot, and a drainage hole for a toilet.  It&#8217;s dark and damp.  I&#8217;m alone.  For some reason, I have a feeling everything is far from ok.<\/p>\n<p>As someone who tries to find the silver lining in every situation,  I tell myself that they&#8217;d realize this was all a big misunderstanding.  Maybe the military will review the drone footage and release me after seeing it was all just amateur video that I recorded over the past month. As the hours turn into days, the sense of fear that I was attempting to keep at bay was now eating me whole.  <\/p>\n<p>I want to know what&#8217;s going on outside of my cell&#8217;s walls. Why wasn&#8217;t I allowed a phone call? Does my family know where I am? How are my kids doing? I miss them&#8230; Will I ever see them again?  The concept of time became foreign, and I find myself repeatedly asking guards what day it is and when I&#8217;m getting out; &#8220;No se,&#8221; I don&#8217;t know, is always their reply.  I spend most of my time crouched in a corner, praying that I would wake up from this horrible nightmare.  <\/p>\n<p>Cut to the next scene.  The door opens, and a guard tells me &#8220;Estas libre,&#8221;  You&#8217;re free to go.  It was the thirteenth day.  The Canadian Embassy negotiated my release, and soon I would be boarding a plane headed back to Toronto.<\/p>\n<p>When I look back to those 13 days in a Cuban jail, I still have a hard time wrapping my head around how a flying a drone nearly cost me my life in prison.  <\/p>\n<p>The Mavic DJI, and GO PRO&#8217;s first drone, which is a third of the size of others on the market today  (it&#8217;s release to the public takes place next week) are sure to top holiday wish lists this year.  With UAVs becoming increasingly accessible to the general public, I would like to warn enthusiasts who plan to travel abroad,  to complete their due diligence on federal laws surrounding remote controlled aerial vehicles.  <\/p>\n<p>As I stated earlier, this is not a &#8220;Chris A. Hughes vs. Cuba&#8221; blog, as the country will eternally hold a piece of my heart if anything, more so after this experience.  This post is simply me, as a Canadian, wanting to share my story with others who are unaware of the consequences that come with something as innocent as flying a recreational drone on vacation.  <\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Everyone complains about Mondays&#8211;If you Google &#8220;Monday Meme,&#8221; there is no shortage of funny images accompanied by witty one-liners about everyone&#8217;s least favourite day of the week. If I told you today was like any other busy Monday, I&#8217;d be&#8230;<\/p>\n","protected":false},"author":1,"featured_media":19478,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[284,56],"tags":[403,406,407,405,404],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19474"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=19474"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19474\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/19478"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=19474"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=19474"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=19474"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}