{"id":19482,"date":"2016-10-11T10:53:33","date_gmt":"2016-10-11T14:53:33","guid":{"rendered":"https:\/\/anerdsworld.com\/?p=19482"},"modified":"2018-02-19T11:01:20","modified_gmt":"2018-02-19T16:01:20","slug":"the-art-of-sales","status":"publish","type":"post","link":"https:\/\/anerdsworld.com\/the-art-of-sales\/","title":{"rendered":"THE ART OF SALES"},"content":{"rendered":"<div class=\"fve-video-wrapper fve-image-embed fve-thumbnail-image youtube\" style=\"padding-bottom:75%;\">\n    <iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/8ASL_sTYxLY?wmode=transparent&#038;modestbranding=1&#038;autohide=1&#038;showinfo=0&#038;rel=0\" width=\"100%\" height=\"100%\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen><\/iframe>    <\/div>\n<p>There are few things that I am more passionate about than sales. For those who aren&#8217;t familiar, sales, simplified are transactions where there is an exchange of a product or service, for money.  You might not realize it, but as Canadians (or Americans, for viewers in the U.S.), we&#8217;re constantly buying things&#8211;whether we need them or not.  Our culture is heavily influenced by consumerism and the way we see it, &#8220;The more, the better&#8221;.<\/p>\n<p>As much as I want to delve into economics, I&#8217;m going to tell you what inspired me to create this vlog.  <\/p>\n<p>It&#8217;s my sixth day here in Medellin, and this morning, while walking through town, I stopped on a street where vendors would often set up shop and hustle whatever their hustle is that day.  Today, I saw three men, all selling the same product &#8212; bottled water.  Their styles, however, were very different.  The first had a microphone and would gain the attention of people using a microphone and loudspeaker.  The second vendor was flamboyant, with a pitch (obviously in Spanish) that mimicked an auctioneer.  Finally, the third of the hustlers would draw attention to himself using a television.  Today was the first day I saw them, but I knew they had plenty of sales experience.  It was clear that they weren&#8217;t hurting nor were they pleading for people to buy their products; in fact, they probably did well enough to provide for their family and buy more water to sell the following day.<\/p>\n<p>I admired these men because I saw myself in them.  By nature, I am a salesman and have been selling\/hustling as far back as I can remember.  When I was a kid, I would buy baseball cards, and when they increased in value or if I had a card that someone wanted, or was in &#8220;demand&#8221; I would resell the card to turn a profit.  Once I realized that I could make money just by being a good salesman, I was hooked.  <strong><a href=\"https:\/\/anerdsworld.com\/my-first-business-at-12-years-old\">I started selling services by the time I was 10 years old<\/a><\/strong>, knocking on my neighbours&#8217; doors asking if they wanted their lawn mowed, or depending on the season, their driveway shoveled.<\/p>\n<p>As the years passed, I changed up my products.  From toy cars to t-shirts to shoes,  you name it; I&#8217;d sell it.  By the time I was a teenager, I was a well-seasoned salesman that could sell pretty much anything.  When I got my first apartment, it doubled as a shop and soon enough I was selling custom t-shirts and shoes, clearing a thousand dollars a day.  Nothing could stop me, and I couldn&#8217;t wrap my head around people who weren&#8217;t trying to make money by selling things.  It was then I realized that selling is actually an art, and not everyone was good at it.<\/p>\n<p>Many people think that success falls in my lap, but it doesn&#8217;t.  I continue to work hard every day and still youtube motivational videos on Youtube, so I can find ways to improve my sales strategy.  If you are reading this because you want to get better at sales and think I am someone you can learn from, I am flattered, but I want more from you &#8212; I want you to follow people who are smarter than you, watch people who are richer than you.  Take notes, research your target audience and make sure that not only are you using the right sales strategy, but you&#8217;re selling the right product too.<\/p>\n<p>And don&#8217;t give up.  Some sales cycles are longer than others.  Did you know goods or services priced over $1000 usually take at least eight client follow-ups before the sale is actually completed?  I know from experience because I am that guy who will pick up the phone, and follow up with customers I didn&#8217;t close.  I love closing, and if I don&#8217;t, I won&#8217;t stop selling until I do.  And then I upsell.  I turn you into a repeat customer.  I make you get referrals and send your family and friends to me.  I am that guy.<\/p>\n<p>Stop to consider this; although I appear to be on vacation, I am still hustling.  This video WILL convert some of you into buyers, and it took time to shoot and edit.  So before you make another excuse as to why you aren&#8217;t selling, think about the three water slinging hustlers in downtown Medellin &#8212; if they can inspire me to improve my sales, they should inspire you to start making some.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-15181\" src=\"https:\/\/anerdsworld.com\/wp-content\/uploads\/2015\/06\/signature1.png\" alt=\"chris-signature\" width=\"200\" height=\"48\" \/><\/p>\n<p>Chris A. Hughes<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are few things that I am more passionate about than sales. For those who aren&#8217;t familiar, sales, simplified are transactions where there is an exchange of a product or service, for money. You might not realize it, but as&#8230;<\/p>\n","protected":false},"author":1,"featured_media":19486,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[19,54,56],"tags":[409,410,411,408],"_links":{"self":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19482"}],"collection":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/comments?post=19482"}],"version-history":[{"count":0,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/posts\/19482\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media\/19486"}],"wp:attachment":[{"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/media?parent=19482"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/categories?post=19482"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/anerdsworld.com\/wp-json\/wp\/v2\/tags?post=19482"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}